app/views/articles/show.html.erb

<% end %>
<% if @article.comments.count == 0 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 9]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 4]]