app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (title like '%')
---
  def index
    #keyword = params[:q]
  #  @articles = Article.find_by_title(keyword) || []
  @articles = Article.search(params[:q])

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hello"], ["content", "hello"], ["created_at", 2016-11-20 08:29:27 UTC], ["updated_at", 2016-11-20 08:29:27 UTC]]
---
  def create
    @article = Article.new(article_params)
    unless(@article.save)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "articles" SET "content" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["content", "hello 123"], ["updated_at", 2016-11-20 10:22:01 UTC], ["id", 5]]
---
  def update
    article = Article.find(params[:id])
    if(article.update(article_params).present?)