app/controllers/comments_controller.rb

INSERT INTO "comments" ("name", "content", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dat"], ["content", "1111111111111"], ["article_id", 9], ["created_at", 2016-11-20 15:03:05 UTC], ["updated_at", 2016-11-20 15:03:05 UTC]]
---
  def create
    comment = Comment.new(comment_params)
    comment.article_id = params[:article_id]
    if(comment.save)